DataProcessors/УправлениеПромоакциями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>УправлениеПромоакциями</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Промоакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Промоакции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуМониторинга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Comment>(АСУ) Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Промоакция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Промоакции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНоменклатуры</Name>
							<Comment>Категория (Тип номенклатуры)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипНоменклатурыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ид</Name>
							<Comment>уникальный идентификатор</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяМарка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварныеМарки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПозиции</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидСтатусаСогласованияПромоакций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покрытие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Покрытия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеОтгрузки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Аутсорс_УсловияОтгрузки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорИзлишки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Аутсорс_ДогСКонтрагентомПоОкончанииППИзлишкиУсловие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Компенсация1шт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РозничнаяЦенаДоАкции</Name>
							<Comment>Розничная цена (80% покрытия), грн</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РозничнаяЦена</Name>
							<Comment>Розничная цена (80% покрытия), грн</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Comment>Договор по которому ведутся взаиморасчеты с контрагентом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоАкционнаяЦена</Name>
							<Comment>Закупочная</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкционнаяЦена</Name>
							<Comment>Закупочная</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекламаСтраница</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидСтраницыРеклама</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекламаБорд</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидБордаРеклама</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродажПредПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродажАкционный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРозничнойЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходОтТекущихПродаж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходностьОтТекущихПродаж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемыйДоходБезКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемаяДоходностьБезКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемаяКомпенсация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтогоДоходСКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемаяДоходностьСКомпенсацией</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриростВДоходе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗагрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мониторинг</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыМониторингаПромоакций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнегоМониторинга</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемаяРозничнаяЦена</Name>
							<Comment>Розничная цена (80% покрытия), грн</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДМП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗакупочнойЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальнаяЦенаМониторинга</Name>
							<Comment>Минимальная цена мониторинга</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПромо</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкционныйОбьем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбьемЗаПредПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/УправлениеПромоакциями/Forms/РасшифровкаПромо/Ext/Form/Module.bsl
Перем УИД;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Номенклатура", Номенклатура);
	Параметры.Свойство("Промоакция", Промоакция);
	Параметры.Свойство("ид", ид);
	
	УИД= Новый УникальныйИдентификатор(ид);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасшифровкаПромоАкций.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	РасшифровкаПромоАкций.Номенклатура КАК Номенклатура,
		|	РасшифровкаПромоАкций.АкционныйОбьем КАК АкционныйОбьем,
		|	РасшифровкаПромоАкций.ОбьемЗаПредПериод КАК ОбьемЗаПредПериод,
		|	ВЫРАЗИТЬ(РасшифровкаПромоАкций.АкционныйОбьем / РасшифровкаПромоАкций.ОбьемЗаПредПериод КАК ЧИСЛО(15, 3)) КАК Прирост
		|ИЗ
		|	РегистрСведений.РасшифровкаПромоАкций КАК РасшифровкаПромоАкций
		|ГДЕ
		|	РасшифровкаПромоАкций.Промоакция = &Промоакция
		|	И РасшифровкаПромоАкций.Номенклатура = &Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТорговаяПлощадка
		|ИТОГИ
		|	СУММА(АкционныйОбьем),
		|	СУММА(ОбьемЗаПредПериод),
		|	ВЫРАЗИТЬ(СРЕДНЕЕ(Прирост) КАК ЧИСЛО(15, 3)) КАК Прирост
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Промоакция", Промоакция);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТорговаяПлощадка = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаТорговаяПлощадка.Следующий() Цикл
		НоваяСтрока = Расшифровка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТорговаяПлощадка);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаАкционныйОбьемПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	ТекущаяСтрока.Прирост = ТекущаяСтрока.ОбьемЗаПредПериод/ТекущаяСтрока.АкционныйОбьем+1;
	ПерваяСтрока = Расшифровка[0];
	ПерваяСтрока.АкционныйОбьем = Расшифровка.Итог("АкционныйОбьем")-ПерваяСтрока.АкционныйОбьем;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаОбьемЗаПредПериодПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	ТекущаяСтрока.Прирост = ТекущаяСтрока.ОбьемЗаПредПериод/ТекущаяСтрока.АкционныйОбьем+1;
	ПерваяСтрока = Расшифровка[0];
	ПерваяСтрока.ОбьемЗаПредПериод = Расшифровка.Итог("ОбьемЗаПредПериод")-ПерваяСтрока.ОбьемЗаПредПериод;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	//Запись расшифровки после изменнений в таблице
	УИД= Новый УникальныйИдентификатор(ид);
	Расшифровка.Удалить(0);
	
	Для Каждого СтрокаТаб из Расшифровка Цикл
		Набор = РегистрыСведений.РасшифровкаПромоАкций.СоздатьНаборЗаписей();
		Набор.Отбор.Промоакция.Установить(Промоакция);
		Набор.Отбор.Номенклатура.Установить(Номенклатура);
		Набор.Отбор.ТорговаяПлощадка.Установить(СтрокаТаб.ТорговаяПлощадка);
		Набор.Прочитать();
		
		Если Набор.Количество() Тогда 
			НоваяЗапись = Набор[0];
			НоваяЗапись.АкционныйОбьем  = СтрокаТаб.АкционныйОбьем;
			НоваяЗапись.ОбьемЗаПредПериод = СтрокаТаб.ОбьемЗаПредПериод;
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
	//запись в регистр НомПромоакции
	ЗаписьАкц = РегистрыСведений.НоменклатураПромоакций.СоздатьМенеджерЗаписи();
	ЗаписьАкц.ид = УИД;
	ЗаписьАкц.Прочитать();
	Выбран = ЗаписьАкц.Выбран();
	
	Если Выбран Тогда
		ЗаписьАкц.ОбъемПродажАкционный = Расшифровка.Итог("АкционныйОбьем");
		ЗаписьАкц.ОбъемПродажПредПериод = Расшифровка.Итог("ОбьемЗаПредПериод");
		ЗаписьАкц.Записать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Сохранить1(Команда)
	СохранитьНаСервере();
    ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
	Об = ПолучитьФорму("Обработка.УправлениеПромоакциями.Форма.Форма");
	Об.фильтрСпискаНоменклатуры ();

КонецПроцедуры
